test_cases/sqDuct/nnfoam_inputs/foam_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4900;
    }
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4950;
    }
    topSym
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          50;
        startFace       5000;
    }
    rightSym
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          50;
        startFace       5050;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2500;
        startFace       5100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2500;
        startFace       7600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
)

// ************************************************************************* //
